[
  {
    "name": "A Pleased Mom",
    "body": "We have participated in the SwimMAC Homeschool program for 2 years. They have taught my child techniques that she will be able to use if she chooses to compete or just swim for exercise and recreation. She loves the instructors."
  },
  {
    "name": "Claudys",
    "body": "Our three kids have had a wonderful experience at Homeschool MAC. The coaching staff offers a great combination of caring and encouraging the kids while still pushing them and challenging them to be the best swimmers they can be."
  },
  {
    "name": "Graham",
    "body": "My three children participate in the Homeschool swim lessons. The lessons have been systematic and focused on skill building. My children enjoy working with their instructors, and the instructors are very motivating."
  },
  {
    "name": "Michelle Beck",
    "body": "The summer homeschool program has been amazing for my children. They get personal, superior, quality attention for an amazing price. They have improved so much in such a short time!"
  },
  {
    "name": "Kathryn B.",
    "body": "Joining SwimMAC Homeschool has been a wonderful decision for us. My daughter loves her instructor! After every class she exclaims, ‘Momma, I had so much fun!’ We are very satisfied with the program and would recommend strongly."
  },
  {
    "name": "Amy K.",
    "body": "Good Afternoon! I just wanted to share my experience with Swim Mac this summer and the AMAZING Swim Coach we had for my 2 daughters! Ali taught both my daughters this summer. She was patient, kind, smart, creative and simply AWESOME! My youngest daughter had quite a fear of water and swimming and she took her from clinging to the side of the pool crying to swimming an entire lap of the pool by herself at her last lesson. It was incredible! My oldest daughter learned so many new techniques and strokes and advanced so much as a swimmer too. I hope you know what a great coach you hired this summer. Please share our sentiments with her if you can. I will definitely be spreading the word about Swim Mac and private lessons there. I hope Ali returns next summer so we can have her continue to teach our girls. Thank you!"
  },
  {
    "name": "Andre B.",
    "body": "We love the class and the coaches are top notch. They learn from great teachers. Great competitive swim, using techniques that I as a competitive swimmer never learned but wish I had. Great flexibility with our changing schedules."
  }
]